Revit 2026 API
EnergyAnalysisDetailModelOptions Class
 Options that govern the calculations for the generation of the energy analysis detail model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class EnergyAnalysisDetailModelOptions : IDisposable
Public Class EnergyAnalysisDetailModelOptions
	Implements IDisposable
public ref class EnergyAnalysisDetailModelOptions : IDisposable
type EnergyAnalysisDetailModelOptions =
    class
        interface IDisposable
    end
The EnergyAnalysisDetailModelOptions type exposes the following members.
Constructors
Name | Description
EnergyAnalysisDetailModelOptions |  Constructs default options for energy analysis detailed model creation.
Top
Properties
Name | Description
EnergyModelType |  It indicates whether the energy model is based on rooms/spaces or building elements.
ExportMullions |  Indicates if to specify the setting for exporting mullions.
IncludeShadingSurfaces |  Indicates if to set and get the setting for if shading surfaces should be included.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SimplifyCurtainSystems |  Indicates if to specify the setting for simplified curtain systems.
Tier |  Level of computation for energy analysis model.
Top
Methods
Name | Description
Dispose | Releases all resources used by the EnergyAnalysisDetailModelOptions
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace